In [1]:
# 5) Perform the following operations on any open source dataset
# Provide summary statistics (mean, median, minimum, maximum, standard deviation) for
# a dataset (age, income etc.) with numeric variables grouped by one of the qualitative
# (categorical) variable. For example, if your categorical variable is age groups and quantitative
# variable is income, then provide summary statistics of income grouped by the age groups.
# Create a list that contains a numeric value for each response to the categorical variable.
# Write a Python program to display some basic statistical details like percentile, mean,
# standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-versicolor’ of
# iris.csv dataset.

In [2]:
import pandas as pd

In [3]:
from sklearn.model_selection import train_test_split
from sklearn import metrics
import seaborn as sns
import matplotlib.pyplot as plt

In [22]:
df1=pd.read_csv('/Users/samiksha/Downloads/5-8-13-14.iris.csv')
df1

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [29]:
df1.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [30]:
df1.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [31]:
df1.shape

(150, 5)

In [32]:
df1.mean()

/var/folders/nd/f14fz1qn4kjch7yqc7z2j1800000gn/T/ipykernel_43381/2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

In [33]:
df1.median()

/var/folders/nd/f14fz1qn4kjch7yqc7z2j1800000gn/T/ipykernel_43381/2279417019.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.median()

sepal.length    5.80
sepal.width     3.00
petal.length    4.35
petal.width     1.30
dtype: float64

In [19]:
# Calculated only for categorical data
df1.variety.mode()

0        Setosa
1    Versicolor
2     Virginica
Name: variety, dtype: object

In [21]:
df1.groupby(['variety']).count()

            sepal.length  sepal.width  petal.length  petal.width
variety
Setosa                50           50            50           50
Versicolor            50           50            50           50
Virginica             50           50            50           50

In [45]:
# Adding column names
df1.rename(columns = {('sepal.length'):'SepalLengthCm', ('sepal.width'):'SepalWidthCm', ('petal.length'):'PetalLengthCm', ('petal.width'):'PetalWidthCm', ('variety'):'Species'}, inplace = True)
df1.head()

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0            5.1           3.5            1.4           0.2  Setosa
1            4.9           3.0            1.4           0.2  Setosa
2            4.7           3.2            1.3           0.2  Setosa
3            4.6           3.1            1.5           0.2  Setosa
4            5.0           3.6            1.4           0.2  Setosa

In [55]:
df1.SepalLengthCm.std()

0.8280661279778629

In [56]:
df1.SepalWidthCm.std()

0.435866284936698

In [59]:
df1.PetalLengthCm.std()

1.7652982332594667

In [61]:

df1.PetalWidthCm.std()

0.7622376689603465

In [62]:

df1.PetalWidthCm.mean()

1.1993333333333336

In [63]:
and so onnn

SyntaxError: invalid syntax (341638348.py, line 1)